In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from collections import OrderedDict

/home/chinmay/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/chinmay/anaconda3/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [2]:
# Order is not maintained when using just dictionary
sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
         'Jan': [150, 200, 50],
         'Feb': [200, 210, 90],
         'Mar': [140, 215, 95]}
sales

{'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
 'Jan': [150, 200, 50],
 'Feb': [200, 210, 90],
 'Mar': [140, 215, 95]}

In [4]:
df = DataFrame(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [5]:
df = df[['Jan', 'Feb', 'Mar','account']]
df

   Jan  Feb  Mar    account
0  150  200  140  Jones LLC
1  200  210  215   Alpha Co
2   50   90   95   Blue Inc

In [ ]:
# Manually reordering columns

In [6]:
# Using ordered Dictionary
sales = OrderedDict([ ('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
          ('Jan', [150, 200, 50]),
          ('Feb',  [200, 210, 90]),
          ('Mar', [140, 215, 95]) ] )
df = pd.DataFrame.from_dict(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [7]:
# Dataframe using Lists
sales = [('Jones LLC', 150, 200, 50),
         ('Alpha Co', 200, 210, 90),
         ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']
df = pd.DataFrame.from_records(sales, columns=labels)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

In [8]:
df.columns

Index(['account', 'Jan', 'Feb', 'Mar'], dtype='object')

In [10]:
# Renaming columns
df.columns = [i.upper() for i in df.columns]
df

     ACCOUNT  JAN  FEB  MAR
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

In [11]:
# Renaming a specific column
df.rename(columns = {'account':'account_name'},inplace=True)
df

     ACCOUNT  JAN  FEB  MAR
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

In [12]:
type(df.columns)

pandas.core.indexes.base.Index

In [14]:
df['ACCOUNT']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: ACCOUNT, dtype: object

In [ ]:
type(df['account_name'])

In [ ]:
df['account_name'][0]

In [ ]:
type(df['account_name'][0])

In [ ]:
df = DataFrame(df,columns=['account_name','jan','feb','mar','apr'])
df

In [ ]:
df.loc[2]

In [ ]:
t = Series(range(50,53))
t

In [ ]:
df['apr'] = t
df

In [ ]:
#Chaining Conditions - Using Bitwise Operators
df[(df['jan'] == 150) | (df['feb'] == 215)]

In [ ]:
# Changing Values in a Column
# Suppose I wish to add 30 to each value in april
df['apr'] = df['apr'].apply(lambda x: x+30)
df

In [ ]:
# Adding a blank column
df.insert(loc=4, column='may', value='')
df

In [ ]:
df = df[['account_name','jan','feb','mar','apr','may']]
df

In [ ]:
# Applying Functions to Multiple Columns
# Adding 10 to jan and feb values
df[['jan','feb']] = df[['jan','feb']].applymap(lambda x:x+10)
df

In [15]:
df['may']=np.nan
df

     ACCOUNT  JAN  FEB  MAR  may
0  Jones LLC  150  200   50  NaN
1   Alpha Co  200  210   90  NaN
2   Blue Inc  140  215   95  NaN

In [ ]:
# Counting Rows with NaNs
nans = df.shape[0] - df.dropna().shape[0]
print('%d rows have missing values' % nans)

In [ ]:
df['may'] = np.arange(3)
df

In [ ]:
df['june']=np.nan
df

In [ ]:
del df['june']
df

In [ ]:
# To delete a column -
df.drop(2)

In [ ]:
#To delete a column
df.drop('may',axis = 1)

In [ ]:
df.sort_index()

In [ ]:
df.sort_values('jan',ascending=False)

In [ ]:
# Statistics Summary
print df.describe().loc['min','feb']
print df.describe()
print "Min of jan month = ",df['jan'].min()
print "Id of min jan month = ",df['jan'].idxmin()
print "Min of all columns = \n",df.min()

In [ ]:
df.info()

In [ ]:
df

In [ ]:
# To replace a value in may and 0th row from 0 to 200
row = 0
col = 'may'
df.set_value(row,col,200)
df

In [ ]:
df['june'] = np.nan
df

In [ ]:
# Selecting NaN Rows
df[df['june'].isnull()]

In [ ]:
# Not Selecting NaN Rows
df[df['june'].notnull()]

In [ ]:
# FIlling nan rows 
df.fillna(value=0, inplace=True)
df

In [ ]:
new_row = Series([np.nan]*len(df.columns),index=df.columns)
new_row

In [ ]:
df = df.append(new_row,ignore_index=True)
df

In [ ]:
df1 = pd.DataFrame({'data1' : np.random.randn(5),'data2' : np.random.randn(5)})
df1.assign(ratio = df1['data1'] / df1['data2'])

In [ ]:
df2 = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'data1' : np.arange(10,15),
                   'data2' : np.arange(30,35)})
df2

In [ ]:
grouped = df2['data1'].groupby(df2['key1'])
grouped.mean()

In [ ]:
df.filter(like='data')

In [ ]:
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

In [ ]:
data.group.value_counts()